{
	"movies":[
		{
			"movieName": "Venom",
			"movieSubname": "",
			"releaseDate": "October 5, 2018",
			"year": "2018",
			"time": "1h 52m",
			"category": "Action, Adventure, Sci-Fi",
			"description": "While exploring space for new habitable worlds, a probe belonging to the bio-engineering corporation Life Foundation discovers a comet covered in symbiotic lifeforms. The probe returns to Earth with four samples, but one escapes and causes the ship to crash in Malaysia. The Life Foundation recovers the other three and transports them to their research facility in San Francisco, where they discover that the symbiotes cannot survive without oxygen-breathing hosts, which often fatally reject the symbiosis. Investigative journalist Eddie Brock reads about these human trials in a classified document in the possession of his fiancée Anne Weying, an attorney preparing a lawsuit defense for the Life Foundation. Brock confronts Life Foundation CEO Carlton Drake about the trials, leading to both Brock and Weying losing their jobs. Consequently, Weying ends their relationship. ",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/venomDescription4.jpg",
			"color": "#569ED8"
		},
		{
			"movieName": "Moonlight",
			"movieSubname": "",
			"releaseDate": "October 21, 2016",
			"year": "2016",
			"time": "1h 51m",
			"category": "Drama",
			"description": "In Liberty City, Miami at the height of the crack epidemic, Afro-Cuban drug dealer Juan finds Chiron, a withdrawn child who goes by the nickname 'Little', hiding from a group of bullies in a crackhouse. He lets Chiron spend the night with him and his girlfriend Teresa before returning Chiron to his mother Paula, who revokes his TV privileges as punishment for worrying her. Chiron continues to spend time with Juan, who teaches him how to swim and mentors him, telling him he can choose his own path in life. One night, Juan encounters Paula smoking crack with one of his customers. Juan berates her for being addicted and for neglecting her son, but she rebukes him for selling crack to her in the first place; all the while, they argue over Chiron's upbringing. She implies that she knows why Chiron gets tormented by his peers, alluding to 'the way he walks' before going home and taking out her frustration on Chiron. The next day, Chiron admits to Juan and Teresa that he hates his mother and asks what a 'faggot' is. Juan tells him it is 'a word used to make gay people feel bad.' He tells Chiron there is nothing wrong with being gay and that he should not allow others to mock him. Chiron then asks Juan whether he sells drugs and whether his mother does drugs and leaves after Juan remorsefully answers yes to both questions.",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/moonlightDescription4.jpg",
			"color": "#6BCAD3"
		},
		{
			"movieName": "Annabelle",
			"movieSubname": "Comes Home",
			"releaseDate": "June 26, 2019",
			"year": "2019",
			"time": "1h 46m",
			"category": "Horror, Mistery, Thriller",
			"description": "Demonologists Ed and Lorraine Warren confiscate the Annabelle doll from nurses Debbie and Camilla, who claimed that the doll often performed violent activities in their apartment. During the drive back home, the doll summons spirits to attack Ed, but he narrowly survives. Annabelle is locked in a sacred glass case in the couple's artifacts room that is blessed by Father Gordon to ensure the evil is contained. Sometime later, the Warrens welcome Mary Ellen, who will be in charge of babysitting their daughter, Judy, at the house while they travel overnight to investigate another case. At school, Judy notices the spirit of a priest that begins following her. Mary Ellen's friend, Daniela, arrives uninvited to the Warrens' home, who is secretly curious about speaking to the dead. She sneaks into the artifacts room and starts examining every item, ultimately trying to contact her late father. She abruptly leaves Annabelle's glass case unlocked, and the terror begins shortly afterwards with the spirit of Annabelle 'Bee' Mullins unleashed. That night, Annabelle begins releasing other spirits, such as the Ferryman, the Bride, a Feeley Meeley board game, and the Black Shuck.",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/annabelleDescription4.jpg",
			"color": "#EB050D"
		},
		{
			"movieName": "Fast and Furious 9",
			"movieSubname": "",
			"releaseDate": "May 19, 2021",
			"year": "2021",
			"time": "2h 23m",
			"category": "Action, Adventure, Crime",
			"description": "In 1989, Jack Toretto participates in a race, with his sons Dominic and Jakob in his pit crew. Dom argues with rival racer Kenny Linder about his dirty tactics. As the race resumes, Linder's car clips Jack's bumper and causes the car to hit a wall and explode, killing him. After the crash, Dom is arrested after nearly beating Linder to death. While serving his sentence, he learns about the dangers of a hairline crack, recalls that Jakob had worked on Jack's car the day he died, and concludes that Jakob was partially responsible for their father's death. Upon release, Dom confronts and challenges Jakob to a race, forcing him to leave town when he loses. In the present, two years after the confrontation against cyberterrorist Cipher, Dom is retired, raising his son Brian with his wife, Letty Ortiz, in isolation from society. Roman Pearce, Tej Parker, and Ramsey arrive with news of Mr. Nobody capturing Cipher, with his plane subsequently being attacked by rogue agents and crashing in Montequinto, a fictional location in Central America. Dom agrees to help them after realizing Jakob is involved. Searching the plane, they find part of a device named Ares, which can hack into any computer-controlled weapons system. The team is then ambushed by a private army led by Jakob, who steals the device. The team rendezvous with Michael Stasiak en route to their safe house. Dom's sister Mia arrives to help find Jakob, and Dom reluctantly allows her to join them. The team learns that Han Lue is connected to Ares, and Letty and Mia go to Tokyo to investigate.",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/fastAndFuriousMoviePoster.jpg",
			"imageTop": "",
			"imageDescription1": "",
			"imageDescription2": "",
			"imageDescription3": "",
			"imageDescription4": "",
			"color": ""
		},
		{
			"movieName": "The Lion King",
			"movieSubname": "The King Has Returned",
			"releaseDate": "July 19, 2019",
			"year": "2019",
			"time": "1h 58m",
			"category": "Animation, Adventure, Drama",
			"description": "In the Pride Lands of Africa, a pride of lions rule over the animal kingdom from Pride Rock. King Mufasa and Queen Sarabi present their newborn son, Simba, to the gathering animals by Rafiki the mandrill, the kingdom's shaman and advisor. Mufasa shows Simba the Pride Lands and explains to him the responsibilities of kingship and the 'circle of life', which connects all living things. Mufasa's younger brother, Scar, covets the throne and plots to get rid of Mufasa and Simba, so he may become king. He tricks Simba and his best friend Nala into exploring a forbidden elephants' graveyard, where they are chased by a clan of hyenas led by the ruthless Shenzi. Mufasa hears about the incident from his majordomo, the hornbill Zazu, and rescues the cubs. Though upset with Simba, Mufasa forgives him and explains that the great kings of the past watch over them from the night sky, from which he will one day watch over Simba. Meanwhile, Scar visits the hyenas and convinces them to help him overthrow Mufasa in exchange for hunting rights in the Pride Lands.",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/reiLeaoMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/theLionKingBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/theLionKingDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/theLionKingDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/theLionKingDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/theLionKingDescription4.jpg",
			"color": "#FAA71B"
		}
	],
	"moviesComing":[
		{
			"movieName": "Spiderman",
			"movieSubname": "Far From Home",
			"releaseDate": "June 26, 2019",
			"year": "2019",
			"time": "2h 9m",
			"category": "Action, Adventure, Sci-Fi",
			"description": "In Ixtenco, Mexico, Nick Fury and Maria Hill investigate an unnatural storm and encounter the Earth Elemental. Quentin Beck, a super-powered individual, arrives to defeat the creature. Beck subsequently defeats the Elemental and is recruited by Fury and Hill. In New York City, the Midtown School of Science and Technology completes its year, which was restarted to accommodate the students who previously disintegrated five years earlier as a result of Thanos' actions.[N 1] They had reappeared un-aged, thanks to the actions of the Avengers.[N 2] The school organizes a two-week summer field trip to Europe, where Peter Parker—who is still mourning the death of his mentor Tony Stark—plans to reveal to classmate MJ his attraction to her. Happy Hogan informs Parker that Fury intends to contact him, but Parker ignores Fury's phone call. Parker and his classmates travel to Venice, Italy, where the Water Elemental attacks. Parker helps protect his classmates, while Beck arrives and defeats the creature. Fury meets with Parker and gives him Stark's glasses, which were meant for his successor. The glasses enable him to communicate with and take command of the artificial intelligence E.D.I.T.H., which has access to Stark Industries' databases and commands a large orbital weapons supply. Beck claims to hail from an alternate reality within the Multiverse, where the four Elementals killed his family and destroyed his civilization. With only the Fire Elemental left to destroy, Beck predicts it will attack Prague. Parker declines Fury's invitation to join the fight and returns to his class trip. ",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/spidermanDescription4.jpg",
			"color": "#CF2724"
		},
		{
			"movieName": "Bad Boys",
			"movieSubname": "For Life",
			"releaseDate": "January 17, 2020",
			"year": "2020",
			"time": "2h 4m",
			"category": "Action, Comedy, Crime",
			"description": "Isabel Aretas, widow of cartel kingpin Benito, escapes from a Mexican prison with the aid of her son Armando. Isabel sends Armando to Miami, tasking him with recovering a substantial stash of money his father Benito had hidden, as well as assassinating the people responsible for his father's arrest and eventual death in prison. Isabel demands that Armando kill Miami detective Mike Lowrey last. In Miami, Mike accompanies his partner Marcus Burnett to the birth of his first grandson. Desiring to spend more time with his family, the aging Marcus tells Mike he intends to retire, to Mike's chagrin. During a party celebrating Marcus' grandson, Mike is shot by Armando and left in a coma for months. Chastised by Isabel for targeting Mike first, Armando continues to assassinate other targets on his list during Mike's convalescence. Fllowing Mike's recovery, he is determined to seek revenge and unsuccessfully attempts to recruit the now-retired Marcus, causing a fall out between them. Mike violently obtains the identity of arms dealer Booker Grassie from an informant. Realizing that Mike will not heed orders to stay away from the investigation, Captain Howard reluctantly allows him to work with the tech-driven team in charge, the Advanced Miami Metro Operations (AMMO), led by Mike's ex-girlfriend Rita. While the team surveils Grassie at an arms deal, Mike determines that the buyers intend to kill Grassie and intervenes, but fails to save him. Later, Marcus is called by Carver Remy, an old informant who believes the assassin is after him. Marcus contacts Mike and the pair travel to Carver, but are too late to save him. Armando escapes after a fistfight with Mike. ",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/badBoysMoviePoster.jpg",
			"imageTop": "",
			"imageDescription1": "",
			"imageDescription2": "",
			"imageDescription3": "",
			"imageDescription4": "",
			"color": ""
		},
		{
			"movieName": "Jurassic World",
			"movieSubname": "Fallen Kingdom",
			"releaseDate": "June 7, 2018",
			"year": "2018",
			"time": "2h 08m",
			"category": "Action, Adventure, Science Fiction",
			"description": "Three years after Jurassic World closed, a volcano about to erupt puts life on Isla Nublar at risk. There is no longer any human presence in the place and the dinosaurs live freely. Claire and Owen decide to rescue the animals and return to the island for the mission. There, the duo encounter terrifying new breeds of giant dinosaurs as they uncover a conspiracy that threatens the entire planet.",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/jurassicWorldPoster.jpg",
			"imageTop": "",
			"imageDescription1": "",
			"imageDescription2": "",
			"imageDescription3": "",
			"imageDescription4": "",
			"color": ""
		},
		{
			"movieName": "Toy Story 4",
			"movieSubname": "",
			"releaseDate": "June 21, 2019",
			"year": "2019",
			"time": "1h 40m",
			"category": "Animation, Adventure, Comedy",
			"description": "Between the events of Toy Story 2 and Toy Story 3, Woody and Bo Peep rescue RC, Andy's remote control car, from being washed away in a storm. Moments later, Bo Peep and her lamp are donated to a new owner. A distraught Woody considers coming with her, but in the end, decides his duty is to stay with Andy. Nine years later, after a college-bound Andy has donated his toys to Bonnie, Woody struggles to adapt, as the toys in Bonnie´s room already have a leader, Dolly. Bonnie also shows little interest in playing with him, giving his sheriff badge to Jessie instead. Woody still remains convinced Bonnie must need him, and sneaks into her backpack the day of her kindergarten orientation. When another child steals Bonnie´s art supplies, Woody gathers objects from the trash and leaves them on Bonnie´s table. Discovering them, Bonnie creates a doll from a spork and some other odds and ends, which she names Forky. Forky comes to life, but suffers an existential crisis and keeps trying to jump into the trash. As Forky quickly becomes Bonnie's new favorite toy, Woody repeatedly has to stop him from throwing himself away. ",
			"moviePoster": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toyStoryMoviePoster.jpg",
			"imageTop": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toystoryBackground.jpg",
			"imageDescription1": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toystoryDescription1.jpg",
			"imageDescription2": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toystoryDescription2.jpg",
			"imageDescription3": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toystoryDescription3.jpg",
			"imageDescription4": "https://raw.githubusercontent.com/Dioguerreiro/CinemaTickets/main/imagens/toystoryDescription4.jpg",
			"color": "#FFE344"
		}
	]
}
